#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1a312e7e-96c2-41d1-9dd4-dff6b0f4e81f]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=63427cdd-76ac-4c26-b075-780d1386f05a]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=de9c0fba-8bfb-4aee-a657-421c2984a085]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=22dccf37-6825-49ee-ba44-571c01a6bd39]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=26176a12-6339-4490-a705-b7e17253a1ff]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=3a992238-d6db-4d78-aa8a-4bd0a96832f6]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab08314c-ea04-4c22-821d-9040eb74269a]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4c7f560b-d0b7-4451-a70c-b0cff899b3dd]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=11463c0e-ffcb-4620-90d5-d3bc3453b6b3]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=fa46fbc7-df18-4d40-bac8-f90276d596f9]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=98e2c03c-c4b2-4247-afcb-2f7c4587a19e]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2cc06bf6-6ce0-403a-a596-f2d85cd3e64d]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=d8e36cf5-f7a8-447e-8b00-2ec4c95a24af]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=edc0aa1e-ba42-4b33-9aa0-bcc3c853b22d]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=da101df4-6f77-4730-9aae-e031254c68c6]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=972b7c2f-0c1f-4623-92de-da5f4720dd1f]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=a56ed4e6-ab45-4d56-a7cb-627c2afcd160]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=fe253f42-fa4c-4de5-931c-5d2eb5a06072]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5a60d017-1041-45de-857a-a86f27c37dea]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c5e74057-c94f-4a30-b18c-84fb1d500477]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ce54c332-46a6-4f14-9e3f-be5e5b933ff1]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ee5f65ba-c02b-438b-9779-b790910e0db0]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ac4101b1-a5f1-4552-90df-639831c6d7d8]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d59efa72-b2de-4586-895e-aefce069184c]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=94ff68ca-1fd6-446d-847b-7d6ad9392901]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e71af3b2-7fff-46ec-b395-654d515095b7]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=00e179d8-079b-480c-9c4b-7780ba2dfa33]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b04206d6-d37b-44c9-b76e-2cbddec96ded]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4ff00512-dc13-4356-8e0f-8fee2715ce0e]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7e2ffc5a-d75c-4af8-ad2f-0e615a9b6cc9]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c32ad305-13ab-44bd-83c6-f1d1cb5f4525]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=0268a0bd-210c-4cab-87db-4b4515b740dd]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a872eecf-9d54-4c1a-9700-d3773bc68c47]
module.keycloak_dev.module.onestopauth.module.client_court-nextcloud-project-232.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=24ddd0d5-8bee-48b6-9376-a53537cd8ee5]
module.keycloak_dev.module.onestopauth.module.client_court-nextcloud-project-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6924e432-864a-4886-94e3-91ae62b6e4eb]
module.keycloak_dev.module.onestopauth.module.client_court-nextcloud-project-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=32d50aaa-e732-42d7-b8ca-29d2f64eec64]
module.keycloak_dev.module.onestopauth.module.client_court-nextcloud-project-232.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=e55dc4d2-7174-4040-948d-1685a58f1816]
module.keycloak_dev.module.onestopauth.module.client_court-nextcloud-project-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=99dcf83f-5a2a-43a7-b5fa-905a5f850496]
module.keycloak_dev.module.onestopauth.module.client_court-nextcloud-project-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4fae8665-9464-4820-9d00-258b549a7a10]
module.keycloak_dev.module.onestopauth.module.client_court-nextcloud-project-232.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=ba58c1d6-e1cb-48f0-ab35-d573997a3631]
module.keycloak_dev.module.onestopauth.module.client_court-nextcloud-project-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a8d2ddb2-ab8d-44ee-ba6f-a4d187ca7f31]
module.keycloak_dev.module.onestopauth.module.client_court-nextcloud-project-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c93a59d0-2c2d-44e9-9047-221c67e8ae4d]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=cfc7b2f4-69dd-4b01-a3cc-bb82a0b1ef3f]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "eda9def9-cb65-4bbe-b155-016a4e0efc7b"
        name                                     = "sso-requests"
      ~ valid_redirect_uris                      = [
          + "http://localhost:3000/*",
            # (2 unchanged elements hidden)
        ]
        # (15 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
      ~ access_type                              = "PUBLIC" -> "CONFIDENTIAL"
        id                                       = "ec6146c8-807a-4c8f-8edf-56984d11ba8d"
        name                                     = "serve-legal-documents-3070"
      - pkce_code_challenge_method               = "S256" -> null
      ~ web_origins                              = [
          - "+",
          - "https://keycloak-a60371-dev.apps.silver.devops.gov.bc.ca/auth/realms/forms-flow-ai/broker/keycloak-oidc/endpoint",
        ]
        # (13 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "serve-legal-documents-3070"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "serve-legal-documents-3070"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_generic_client_protocol_mapper.display_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "display_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "displayName"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "serve-legal-documents-3070"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "serve-legal-documents-3070"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://keycloak-a60371-prod.apps.silver.devops.gov.bc.ca/auth/realms/forms-flow-ai/broker/keycloak-oidc/endpoint",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "eda9def9-cb65-4bbe-b155-016a4e0efc7b"
        name                                     = "sso-requests"
      ~ valid_redirect_uris                      = [
          - "http://localhost:3000/*",
            # (2 unchanged elements hidden)
        ]
        # (15 unchanged attributes hidden)
    }

  # module.keycloak_test.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "serve-legal-documents-3070"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "serve-legal-documents-3070"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_generic_client_protocol_mapper.display_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "display_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "displayName"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_serve-legal-documents-3070.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "serve-legal-documents-3070"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "serve-legal-documents-3070"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://keycloak-a60371-test.apps.silver.devops.gov.bc.ca/auth/realms/forms-flow-ai/broker/keycloak-oidc/endpoint",
        ]
    }

Plan: 20 to add, 2 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 1084 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*